---
kind: method
id: M:Autodesk.Revit.DB.NumberingSchemaType.op_Equality(Autodesk.Revit.DB.NumberingSchemaType,Autodesk.Revit.DB.NumberingSchemaType)
source: html/f99f9bfd-bac8-18c6-07a6-d9995bd02315.htm
---
# Autodesk.Revit.DB.NumberingSchemaType.op_Equality Method

Compares two NumberingSchemaType instances.

## Syntax (C#)
```csharp
public static bool operator ==(
	NumberingSchemaType first,
	NumberingSchemaType second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.NumberingSchemaType`) - The first NumberingSchemaType.
- **second** (`Autodesk.Revit.DB.NumberingSchemaType`) - The second NumberingSchemaType.

## Returns
True if the inputs are identical, false if they are different.